Revit 2027 API
Family.StructuralMaterialType Property
 The family's structural material type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralMaterialType StructuralMaterialType { get; }
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
member StructuralMaterialType : StructuralMaterialType with get
Property Value
StructuralMaterialType
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace